app/Http/Controllers/archivo3.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:siiLR="https://www2.agenciatributaria.gob.es/static_files/common/internet/dep/aplicaciones/es/aeat/ssii/fact/ws/SuministroLR.xsd" xmlns:sii="https://www2.agenciatributaria.gob.es/static_files/common/internet/dep/aplicaciones/es/aeat/ssii/fact/ws/SuministroInformacion.xsd"><soapenv:Body><siiLR:SuministroLRFacturasEmitidas ><sii:Cabecera ><sii:IDVersionSii>1.1</sii:IDVersionSii><sii:Titular><sii:NombreRazon>Rubén Núñez Campillo</sii:NombreRazon><sii:NIF>77856181P</sii:NIF></sii:Titular><sii:TipoComunicacion>A0</sii:TipoComunicacion></sii:Cabecera><siiLR:RegistroLRFacturasEmitidas><sii:PeriodoLiquidacion ><sii:Ejercicio>2023</sii:Ejercicio><sii:Periodo>12</sii:Periodo></sii:PeriodoLiquidacion><siiLR:IDFactura><sii:IDEmisorFactura ><sii:NIF>77856181P</sii:NIF></sii:IDEmisorFactura><sii:NumSerieFacturaEmisor >333</sii:NumSerieFacturaEmisor><sii:FechaExpedicionFacturaEmisor >13/06/2023</sii:FechaExpedicionFacturaEmisor></siiLR:IDFactura><siiLR:FacturaExpedida><sii:TipoFactura >F1</sii:TipoFactura><sii:ClaveRegimenEspecialOTrascendencia >01</sii:ClaveRegimenEspecialOTrascendencia><sii:ImporteTotal >104</sii:ImporteTotal><sii:DescripcionOperacion >Venta de pulseras</sii:DescripcionOperacion><sii:Contraparte ><sii:NombreRazon>Iván Ríos</sii:NombreRazon><sii:NIF>4918369D</sii:NIF></sii:Contraparte><sii:TipoDesglose ><sii:DesgloseFactura><sii:Sujeta><sii:NoExenta><sii:TipoNoExenta>S1</sii:TipoNoExenta><sii:DesgloseIVA><sii:DetalleIVA><sii:TipoImpositivo>4</sii:TipoImpositivo><sii:BaseImponible>100</sii:BaseImponible><sii:CuotaRepercutida>4</sii:CuotaRepercutida><sii:TipoRecargoEquivalencia>0.5</sii:TipoRecargoEquivalencia><sii:CuotaRecargoEquivalencia>0.5</sii:CuotaRecargoEquivalencia></sii:DetalleIVA></sii:DesgloseIVA></sii:NoExenta></sii:Sujeta></sii:DesgloseFactura></sii:TipoDesglose></siiLR:FacturaExpedida></siiLR:RegistroLRFacturasEmitidas><siiLR:RegistroLRFacturasEmitidas><sii:PeriodoLiquidacion ><sii:Ejercicio>2023</sii:Ejercicio><sii:Periodo>02</sii:Periodo></sii:PeriodoLiquidacion><siiLR:IDFactura><sii:IDEmisorFactura ><sii:NIF>77856181P</sii:NIF></sii:IDEmisorFactura><sii:NumSerieFacturaEmisor >7894</sii:NumSerieFacturaEmisor><sii:FechaExpedicionFacturaEmisor >14/06/2023</sii:FechaExpedicionFacturaEmisor></siiLR:IDFactura><siiLR:FacturaExpedida><sii:TipoFactura >F1</sii:TipoFactura><sii:ClaveRegimenEspecialOTrascendencia >01</sii:ClaveRegimenEspecialOTrascendencia><sii:ImporteTotal >14.56</sii:ImporteTotal><sii:DescripcionOperacion >Otra facturita más</sii:DescripcionOperacion><sii:Contraparte ><sii:NombreRazon>Iván Ríos</sii:NombreRazon><sii:NIF>4918369D</sii:NIF></sii:Contraparte><sii:TipoDesglose ><sii:DesgloseFactura><sii:Sujeta><sii:NoExenta><sii:TipoNoExenta>S1</sii:TipoNoExenta><sii:DesgloseIVA><sii:DetalleIVA><sii:TipoImpositivo>4</sii:TipoImpositivo><sii:BaseImponible>14</sii:BaseImponible><sii:CuotaRepercutida>0.56</sii:CuotaRepercutida><sii:TipoRecargoEquivalencia>0.5</sii:TipoRecargoEquivalencia><sii:CuotaRecargoEquivalencia>0.07</sii:CuotaRecargoEquivalencia></sii:DetalleIVA></sii:DesgloseIVA></sii:NoExenta></sii:Sujeta></sii:DesgloseFactura></sii:TipoDesglose></siiLR:FacturaExpedida></siiLR:RegistroLRFacturasEmitidas></siiLR:SuministroLRFacturasEmitidas></soapenv:Body></soapenv:Envelope>
